## 판다스(Pandas) 04 Page 2

In [1]:
import pandas as pd

persons_dict = { 'Name' : [ 'John', 'Sabre', 'Kim', 'Sato' ],
                'Country' : [ 'USA', 'France', 'Korea', 'Japan' ],
                'Age' : [ 31, 33, 28, 40 ],
                'Job' : ['Student', 'Lawyer', 'Developer', 'Chef'] }

In [2]:
df1 = pd.DataFrame(persons_dict)

df1

   Age Country        Job   Name
0   31     USA    Student   John
1   33  France     Lawyer  Sabre
2   28   Korea  Developer    Kim
3   40   Japan       Chef   Sato

In [3]:
df2 = pd.DataFrame(data = persons_dict, 
                   columns = [ 'Name', 'Country', 'Age', 'Job' ] ) 

df2

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef

In [4]:
# DataFrame 생성 시, index 옵션을 주면 index 값을 별도로 지정할 수 있음
df3 = pd.DataFrame(data = persons_dict, 
                   columns = [ 'Name', 'Country', 'Age', 'Job' ],
                   index = ['one', 'two', 'three', 'four' ] ) 

df3

        Name Country  Age        Job
one     John     USA   31    Student
two    Sabre  France   33     Lawyer
three    Kim   Korea   28  Developer
four    Sato   Japan   40       Chef

## 판다스(Pandas) 04  Page 3

In [5]:
from collections import OrderedDict


ordered_persons_dict = OrderedDict( [('Name', [ 'John', 'Sabre', 'Kim', 'Sato' ]),
                                     ('Country', [ 'USA', 'France', 'Korea', 'Japan' ]),
                                     ('Age', [ 31, 33, 28, 40 ]),
                                     ('Job', ['Student', 'Lawyer', 'Developer', 'Chef'])] )

In [6]:
df1 = pd.DataFrame(ordered_persons_dict) 

df1

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef

In [7]:
 # DataFrame 생성 시, index 옵션을 주면 index 값을 별도로 지정할 수 있음

df2 = pd.DataFrame(ordered_persons_dict,index = ['one', 'two', 'three', 'four' ]) 

df2

        Name Country  Age        Job
one     John     USA   31    Student
two    Sabre  France   33     Lawyer
three    Kim   Korea   28  Developer
four    Sato   Japan   40       Chef